const valueList = {
    "length": {
        "Вёрст": {
            "Сажень": {
                multiple: 500,
                CI: " c"
            },

            "Футы": {
                multiple: 3500,
                CI: " ф"
            },

            "Аршины": {
                multiple: 1500,
                CI: " ар"
            },

            "Пяди": {
                multiple: 1 / 375,
                CI: " п"
            },

            "Километры": {
                multiple: 1.0668,
                CI: " км"
            },

            "Метры": {
                multiple: 1066.8,
                CI: " м"
            },

            "Сантиметры": {
                multiple: 1066800,
                CI: " cм"
            },

            "Миллиметры": {
                multiple: 106680000,
                CI: " мм"
            }

        },

        "Аршинов": {
            "Вёрсты": {
                multiple: 1 / 1500,
                CI: " в"
            },

            "Сажень": {
                multiple: 3,
                CI: " ар"
            },

            "Футы": {
                multiple: 2 * (1 / 3),
                CI: " ф"
            },

            "Пядь": {
                multiple: 1 / 4,
                CI: " п"
            },

            "Километры": {
                multiple: 0.0021336,
                CI: " км"
            },

            "Метры": {
                multiple: 0.7112,
                CI: " м"
            },

            "Сантиметры": {
                multiple: 71.12,
                CI: " см"
            },

            "Миллиметры": {
                multiple: 711.2,
                CI: " мм"
            }

        },

        "Футов": {
            "Вёрсты": {
                multiple: 1 / 3500,
                CI: " в"
            },

            "Сажень": {
                multiple: 1 / 7,
                CI: " с"
            },

            "Аршины": {
                multiple: 3 / 7,
                CI: " ар"
            },

            "Пядь": {
                multiple: 7 / 12,
                CI: " п"
            },

            "Километры": {
                multiple: 0.0003048,
                CI: " км"
            },

            "Метры": {
                multiple: 0.3048,
                CI: " м"
            },

            "Сантиметры": {
                multiple: 30.48,
                CI: " cм"
            },

            "Миллиметры": {
                multiple: 304.8,
                CI: " мм"
            }
        },

        "Сажень": {
            "Вёрсты": {
                multiple: 1 / 500,
                CI: " в"
            },

            "Аршины": {
                multiple: 3,
                CI: " ар"
            },

            "Футы": {
                multiple: 7,
                CI: " ф"
            },

            "Пядь": {
                multiple: 1 / 12,
                CI: " п"
            },

            "Километры": {
                multiple: 0.0021336,
                CI: " км"
            },

            "Метры": {
                multiple: 2.1336,
                CI: " м"
            },

            "Сантиметры": {
                multiple: 213.36,
                CI: " см"
            },

            "Миллиметры": {
                multiple: 2133.6,
                CI: " мм"
            }

        },

        "Пядей": {
            "Вёрсты": {
                multiple: 375,
                CI: " в"
            },

            "Сажень": {
                multiple: 12,
                CI: " с"
            },

            "Аршины": {
                multiple: 1 / 4,
                CI: " ар"
            },

            "Футы": {
                multiple: 7 / 12,
                CI: " ф"
            },

            "Километры": {
                multiple: 0.0001778,
                CI: " км"
            },

            "Метры": {
                multiple: 0.1778,
                CI: " м"
            },

            "Сантиметры": {
                multiple: 17.78,
                CI: " см"
            },

            "Миллиметры": {
                multiple: 1778,
                CI: " мм"
            },
        }
    },
    "square": {
        "Десятин": {
            "Вёрсты": {
                multiple: 1138.1 / 10925.4,
                CI: " в"
            },

            "Аршины": {
                multiple: 0.505805 / 10925.4,
                CI: " ар²"
            },

            "Футы": {
                multiple: 9.290304 / 10925.4,
                CI: " ф²"
            },

            "Сажень": {
                multiple: 250000,
                CI: " с²"
            },

            "Гектары": {
                multiple: 1.0925,
                CI: " га"
            },

            "Сотки": {
                multiple: 109.25,
                CI: " соток"
            },

            "Километры": {
                multiple: 1.1381,
                CI: " км²"
            },

            "Метры": {
                multiple: 10925.4,
                CI: " м²"
            },

            "Сантиметры": {
                multiple: 1092540,
                CI: " cм"
            },
    
            "Миллиметры": {
                multiple: 109254000,
                CI: " мм"
            }
        },

        "Вёрст": {
            "Десятины": {
                multiple:  10925.4 / 1138.1,
                CI: " д"
            },

            "Сажень": {
                multiple: 250000,
                CI: " c"
            },

            "Футы": {
                multiple: 9.290304 / 1138.1,
                CI: " ф"
            },

            "Аршины": {
                multiple: 0.505805 / 1138.1 * 250000,
                CI: " ар"
            },

            "Километры": {
                multiple: 1.1381,
                CI: " км²"
            },

            "Метры": {
                multiple: 1138.1,
                CI: " м²"
            },

            "Сантиметры": {
                multiple: 113810,
                CI: " cм"
            },
    
            "Миллиметры": {
                multiple: 1138100,
                CI: " мм"
            }
        },

        "Аршинов": {
            "Десятины": {
                multiple:  10925.4 / 0.505805,
                CI: " д"
            },

            "Вёрсты": {
                multiple: 10925.4 / 0.505805,
                CI: " в"
            },

            "Сажень": {
                multiple:  4.55225 / 0.505805,
                CI: " ар"
            },

            "Футы": {
                multiple: 9.290304 / 0.505805,
                CI: " ф"
            },

            "Километры": {
                multiple: 0.000505805,
                CI: " км"
            },

            "Метры": {
                multiple: 0.505805,
                CI: " м"
            },

            "Сантиметры": {
                multiple: 50.5805,
                CI: " cм"
            },
    
            "Миллиметры": {
                multiple: 505.805,
                CI: " мм"
            }
        },
        
        "Футов": {
            "Десятины": {
                multiple: 10925.4 / 9.290304,
                CI: " д"
            },

            "Вёрсты": {
                multiple:  1138.1 / 9.290304,
                CI: " в"
            },
    
            "Сажень": {
                multiple: 4.55225 / 9.290304,
                CI: " с"
            },
    
            "Аршины": {
                multiple:  0.505805 / 9.290304,
                CI: " ар"
            },
    
            "Километры": {
                multiple: 0.009290304,
                CI: " км"
            },
    
            "Метры": {
                multiple: 9.290304,
                CI: " м"
            },
    
            "Сантиметры": {
                multiple: 929.0304,
                CI: " cм"
            },
    
            "Миллиметры": {
                multiple: 9290.304,
                CI: " мм"
            }
        },
    
        "Сажень": {
            "Вёрсты": {
                multiple: 1 / 250000,
                CI: " в"
            },
    
            "Аршины": {
                multiple:  0.505805 / 4.55225,
                CI: " ар"
            },
    
            "Футы": {
                multiple:  9.290304 / 4.55225,
                CI: " ф"
            },
    
            "Километры": {
                multiple: 0.00455225,
                CI: " км"
            },
    
            "Метры": {
                multiple: 4.55225,
                CI: " м"
            },
    
            "Сантиметры": {
                multiple: 455.225,
                CI: " см"
            },
    
            "Миллиметры": {
                multiple: 4552.25,
                CI: " мм"
            }
        }
    },

    "volume": {

    },

    "mass": {
        
    }
}

