const valueListForLength = {
    "Вёрст": {
        "Сажень": {
            multiple: 500,
            CI: " c"
        },
        
        "Футы": {
            multiple: 3500,
            CI: " ф"
        },

        "Аршины": {
            multiple: 1500,
            CI: " ар"
        },

        "Пяди": {
            multiple: 1/375,
            CI: " п"
        },

        "Вершки": {

        },

        "Линии": {

        },

        "Километры": {
            multiple: 1.0668,
            CI: " км"
        },

        "Метры": {
            multiple: 1066.8,
            CI: " м"
        },

        "Сантиметры": {
            multiple: 1066800,
            CI: " cм"
        },

        "Миллиметры": {
            multiple: 106680000,
            CI: " мм"
        }

    },


    "Фунтов": {
        "Килограммы": {
            multiple: 0.453592,
            CI: " кг"
        },
        
        "Граммы": {
            multiple: 453.592,
            CI: " гр"
        },

        "Миллиграммы": {
            multiple: 453592,
            CI: " мг"
        }
    },

    "Аршинов": {
        "Вёрсты": {
            multiple: 1/1500,
            CI: " в"
        },

        "Сажень": {
            multiple: 3,
            CI: " ар"
        },

        "Футы": {
            multiple: 2 * (1 / 3),
            CI: " ф"
        },

        "Пядь": {
            multiple: 1/4,
            CI: " п"
        },

        "Вершки": {
            multiple: 1/16,
            CI: " в"
        },

        "Линии": {
            multiple: 1/280,
            CI: " л"
        },

        "Километры": {
            multiple: 0.0021336,
            CI: " км"
        },

        "Метры": {
            multiple: 0.7112,
            CI: " м" 
        },
        
        "Сантиметры": {
            multiple: 71.12,
            CI: " см"
        },

        "Миллиметры": {
            multiple: 711.2,
            CI: " мм"
        }

    },

    "Футов": {
        "Вёрсты": {
            multiple: 1/3500,
            CI: " в"
        },

        "Сажень": {
            multiple: 1/7,
            CI: " с"
        },

        "Аршины": {
            multiple: 3/7,
            CI: " ар"
        },

        "Километры": {
            multiple: 0.0003048,
            CI: " км"
        },

        "Метры": {
            multiple: 0.3048,
            CI: " м"
        },

        "Сантиметры": {
            multiple: 30.48,
            CI: " cм" 
        },

        "Миллиметры": {
            multiple: 304.8,
            CI: " мм" 
        }
    },

    "Сажень": {
        "Вёрсты": {
            multiple: 1/500,
            CI: " в"
        },

        "Аршины": {
            multiple: 3,
            CI: " ар"
        },

        "Футы": {
          multiple: 7,
          CI: " ф"  
        },

        "Километры": {
            multiple: 0.0021336,
            CI: " км"
        },

        "Метры": {
            multiple: 2.1336,
            CI: " м" 
        },

        "Сантиметры": {
            multiple: 213.36,
            CI: " см"
        },

        "Миллиметры": {
            multiple: 2133.6,
            CI: " мм"
        }

    },

    "Пядей": {
        "Вёрсты": {
            multiple: 375,
            CI: " в"
        },

        "Аршины": {
            multiple: 1/4,
            CI: " ар"
        },

        "Футы": {
            multiple: 7/12,
            CI: " ф"
        },

        "Километры": {
            multiple: 0.0001778,
            CI: " км"
        },

        "Метры": {
            multiple: 0.1778
        },

        "Сантиметры": {
            multiple: 17.78,
            CI: " см" 
        },

        "Миллиметры": {
            multiple: 1778,
            CI: " мм"
        },
    },

    "Вершок": {
        "Аршины": {
            multiple: 1/16,
            CI: " ар"
        },

        "Футы": {
            multiple: 7/48,
            CI: " ф"
        },

        "Километры": {
            multiple: 0.00004455,
            CI: " км"
        },

        "Метры": {
            multiple: 0.04455,
            CI: " м"
        },

        "Сантиметры": {
            multiple: 4.445,
            CI: " см" 
        },

        "Миллиметры": {
            multiple: 44.45,
            CI: " мм" 
        }

    },

    "Линий": {
        "Аршины": {
            multiple: 1/2800,
            CI: " ар"
        },

        "Футы": {
            multiple: 1/120,
            CI: " ф"
        },

        "Метры": {
            multiple: 0.00254,
            CI: " м"
        },

        "Сантиметры": {
            multiple: 0.254,
            CI: " см"
        },

        "Миллиметры": {
            multiple: 2.54,
            CI: " мм" 
        }

    }
}

const valueListForSquare = {
    "Десятин": {
        "Сажень": {
            multiple: 250000,
            CI: " с²"
        },

        "Гектары": {
            multiple: 1.0925,
            CI: " га"
        },

        "Сотки": {
            multiple: 109.25,
            CI: " соток"
        },

        "Километры": {
            multiple: 1.1381,
            CI: " км²"
        },

        "Метры": {
            multiple: 10925.4,
            CI: " м²"
        }
    },
}