const valueList = {
    "length": {
        "Вёрста": {
            "Сажень": {
                multiple: 500,
            },

            "Фут": {
                multiple: 3500,
            },

            "Аршин": {
                multiple: 1500,
            },

            "Пядь": {
                multiple: 1 / 375,
            },

            "Километры": {
                multiple: 1.0668,
            },

            "Метры": {
                multiple: 1066.8,
            },

            "Сантиметры": {
                multiple: 1066800,
            },

            "Миллиметры": {
                multiple: 106680000,

            }

        },

        "Аршин": {
            "Вёрста": {
                multiple: 1 / 1500,
            },

            "Сажень": {
                multiple: 3,
            },

            "Фут": {
                multiple: 2 * (1 / 3),
            },

            "Пядь": {
                multiple: 1 / 4,
            },

            "Километры": {
                multiple: 0.0021336,
            },

            "Метры": {
                multiple: 0.7112,
            },

            "Сантиметры": {
                multiple: 71.12,
            },

            "Миллиметры": {
                multiple: 711.2,
            }

        },

        "Фут": {
            "Вёрста": {
                multiple: 1 / 3500,
            },

            "Сажень": {
                multiple: 1 / 7,
            },

            "Аршин": {
                multiple: 3 / 7,
            },

            "Пядь": {
                multiple: 7 / 12,
            },

            "Километры": {
                multiple: 0.0003048,
            },

            "Метры": {
                multiple: 0.3048,
            },

            "Сантиметры": {
                multiple: 30.48,
            },

            "Миллиметры": {
                multiple: 304.8,
            }
        },

        "Сажень": {
            "Вёрста": {
                multiple: 1 / 500,
            },

            "Аршин": {
                multiple: 3,
            },

            "Фут": {
                multiple: 7,
            },

            "Пядь": {
                multiple: 1 / 12,
            },

            "Километры": {
                multiple: 0.0021336,
            },

            "Метры": {
                multiple: 2.1336,
            },

            "Сантиметры": {
                multiple: 213.36,
            },

            "Миллиметры": {
                multiple: 2133.6,
            }

        },

        "Пядь": {
            "Вёрста": {
                multiple: 375,
            },

            "Сажень": {
                multiple: 12,
            },

            "Аршин": {
                multiple: 1 / 4,
            },

            "Фут": {
                multiple: 7 / 12,
            },

            "Километры": {
                multiple: 0.0001778,
            },

            "Метры": {
                multiple: 0.1778,
            },

            "Сантиметры": {
                multiple: 17.78,
            },

            "Миллиметры": {
                multiple: 1778,
            },
        }
    },
    "square": {
        "Десятина": {
            "Вёрста": {
                multiple: 1138.1 / 10925.4,
            },

            "Аршин": {
                multiple: 0.505805 / 10925.4,
            },

            "Фут": {
                multiple: 9.290304 / 10925.4,
            },

            "Сажен": {
                multiple: 250000,
            },

            "Гектары": {
                multiple: 1.0925,
            },

            "Сотки": {
                multiple: 109.25,
            },

            "Километры": {
                multiple: 1.1381,
            },

            "Метры": {
                multiple: 10925.4,
            },

            "Сантиметры": {
                multiple: 1092540,
            },
    
            "Миллиметры": {
                multiple: 109254000,
            }
        },

        "Вёрста": {
            "Десятина": {
                multiple:  10925.4 / 1138.1,
            },

            "Сажень": {
                multiple: 250000,
            },

            "Фут": {
                multiple: 9.290304 / 1138.1,
            },

            "Аршин": {
                multiple: 0.505805 / 1138.1 * 250000,
            },

            "Километры": {
                multiple: 1.1381,
            },

            "Метры": {
                multiple: 1138.1,
            },

            "Сантиметры": {
                multiple: 113810,
            },
    
            "Миллиметры": {
                multiple: 1138100,
            }
        },

        "Аршин": {
            "Десятина": {
                multiple:  10925.4 / 0.505805,
            },

            "Вёрста": {
                multiple: 10925.4 / 0.505805,
            },

            "Сажень": {
                multiple:  4.55225 / 0.505805,
            },

            "Фут": {
                multiple: 9.290304 / 0.505805,
            },

            "Километры": {
                multiple: 0.000505805,
            },

            "Метры": {
                multiple: 0.505805,
            },

            "Сантиметры": {
                multiple: 50.5805,
            },
    
            "Миллиметры": {
                multiple: 505.805,
            }
        },
        
        "Фут": {
            "Десятина": {
                multiple: 10925.4 / 9.290304,
            },

            "Вёрста": {
                multiple:  1138.1 / 9.290304,
            },
    
            "Сажень": {
                multiple: 4.55225 / 9.290304,
            },
    
            "Аршин": {
                multiple:  0.505805 / 9.290304,
            },
    
            "Километры": {
                multiple: 0.009290304,
            },
    
            "Метры": {
                multiple: 9.290304,
            },
    
            "Сантиметры": {
                multiple: 929.0304,
            },
    
            "Миллиметры": {
                multiple: 9290.304,
            }
        },
    
        "Сажень": {
            "Десятина": {
                multiple: 1 / 250000,
            },

            "Вёрста": {
                multiple: 1 / 250000,
            },
    
            "Аршин": {
                multiple:  0.505805 / 4.55225,
            },
    
            "Фут": {
                multiple:  9.290304 / 4.55225,
            },
    
            "Километры": {
                multiple: 0.00455225,
            },
    
            "Метры": {
                multiple: 4.55225,
            },
    
            "Сантиметры": {
                multiple: 455.225,
            },
    
            "Миллиметры": {
                multiple: 4552.25,
            }
        }
    },

    "volume": {
        "Аршин": {
            "Сажень": {
                multiple:  1 / 27,
            },

            "Фут": {
                multiple: 343 / 27,
            },

            "Километры": {
                multiple: 0.0097127,
            },

            "Метры": {
                multiple: 9.7127,
            },

            "Сантиметры": {
                multiple: 971.27,
            },
    
            "Миллиметры": {
                multiple: 97127,
            }
        },
        
        "Фут": {
            "Сажень": {
                multiple: 1 / 343,
                CI: " с"
            },
    
            "Аршин": {
                multiple:  27 / 343,
                CI: " ар"
            },
    
            "Километры": {
                multiple: 0.03597288,
                CI: " км"
            },
    
            "Метры": {
                multiple: 35.97288,
                CI: " м"
            },
    
            "Сантиметры": {
                multiple: 3597.288,
                CI: " cм"
            },
    
            "Миллиметры": {
                multiple: 35972.88,
                CI: " мм"
            }
        },
    
        "Сажень": {
            "Аршин": {
                multiple:  27,
                CI: " ар"
            },
    
            "Фут": {
                multiple:  343,
                CI: " ф"
            },
    
            "Километры": {
                multiple: 0.0097127,
                CI: " км"
            },
    
            "Метры": {
                multiple: 9.7127,
                CI: " м"
            },
    
            "Сантиметры": {
                multiple: 971.27,
                CI: " см"
            },
    
            "Миллиметры": {
                multiple: 97127,
                CI: " мм"
            }
        }
    },

    "mass": {
        "Ласт": {

        },

        "Четверть вощаная": {

        },

        "Берковец": {

        },

        "Контарь": {
            
        }
    }
}

