const valueList = {
    "Вёрст": {
        "Километры": {
            multiple: 1.0668,
            CI: " км"
        },

        "Метры": {
            multiple: 1066.8,
            CI: " м"
        },

        "Сантиметры": {
            multiple: 1066800,
            CI: " cм"
        },

        "Миллиметры": {
            multiple: 106680000,
            CI: " мм"
        }

    },

    "Десятин": {
        "Гектары": {
            multiple: 1.0925,
            CI: " га"
        },

        "Сотки": {
            multiple: 109.25,
            CI: " соток"
        },

        "Метры": {
            multiple: 10925.4,
            CI: " м²"
        }
    },

    "Фунтов": {
        "Килограммы": {
            multiple: 0.453592,
            CI: " кг"
        },
        
        "Граммы": {
            multiple: 453.592,
            CI: " гр"
        }
    },

    "Аршинов": {
        multiple: 0.7112,
        CI: "м"
    },

    "Футов": {
        multiple: 30.48,
        CI: "cм" 
    },

    "Сажень": {
        multiple: 2.1336,
        CI: "м" 
    },

    "Пядей": {
        multiple: 17.78,
        CI: "см" 
    },

    "Вершок": {
        multiple: 4.445,
        CI: "см" 
    },

    "Линий": {
        multiple: 2.54,
        CI: "мм" 
    }
}
